tap 'caskroom/cask'

brew 'git'
brew 'npm'
brew 'node'
brew 'php'
brew 'yarn'
brew 'grunt'


cask 'visual-studio-code'
cask 'atom'
cask 'google-chrome'
cask 'firefox'
cask 'vlc'
cask 'spotify'

# mas is used with the mas-cli utility to download programs from your command line
mas 'Slack', id: 803453959
mas 'Bear', id: 1091189122
mas 'Trello', id: 1278508951
mas 'CopyClip', id: 595191960
mas 'Pocket', id: 568494494
mas 'The Unarchiver', id: 425424353
