# Install core utilities (those that come with OS X are outdated).
brew "coreutils"

# Install some other useful utilities.
brew "moreutils"

# Install `find`, `locate`, `updatedb`...
brew "findutils"

# Taps
# Note on Casks: Some casks may not be the most up to date version and may be broken
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap 'homebrew/bundle'
tap 'buo/cask-upgrade'
# Optional taps
# for bun.sh
#tap 'oven-sh/bun'

# Font util
brew "font-util"

# Install other necessary binaries.
brew "grep"
brew "gnu-sed"
brew "openssh"
brew "wget"
brew "ruby"
brew "zsh"
brew "bash"
brew "bash-completion"
brew "neovim"
brew "btop"
brew "bottom"
brew "lazygit"
brew "gdu"
brew "git"
brew "hub"
brew "libpq"
brew "gh"
brew "fd"
brew "ccat"
brew "eza" # replacement for exa (no longer maintained)
brew "bat"
brew "httpstat"
brew "zoxide"
brew "atuin"
brew "mkcert"
brew "trash"
brew "mackup"
brew "mas"
brew "navi"
brew "tmux"

# Development binaries
brew "mysql-client"
brew "cloudflared"
# Kubernetes Package Manager
brew "helm"
# Kubernetes Compose Conversion Tool
brew "kompose"
# Apple Silicon VM's
brew "cirruslabs/cli/tart"
# Misc VM's
brew "hashicorp/tap/hashicorp-vagrant"
# Github Actions locally
brew "act"
# Fly.io CLI
brew "flyctl"

# Optional, but recommended binaries
#brew 'pngquant'
#brew 'svgo'
#brew 'gifsicle'
#brew "deno"
#brew "railway"
#brew "bun"
#brew "awscli"
#brew "doctl"

# Fonts
# Most not available in Google Fonts install
# To search: brew search "/font-/"
brew "font-monaspace"
brew "font-input"
brew "font-gilbert"
brew "font-cascadia-code"
brew "font-monoid"
brew "font-qwigley"
brew "font-hasklig"
brew "font-covered-by-your-grace"
brew "font-league-gothic"
brew "font-rambla"
brew "font-share-tech"
brew "font-3270-nerd-font"
brew "font-fira-mono-nerd-font"
brew "font-inconsolata-go-nerd-font"
brew "font-inconsolata-lgc-nerd-font"
brew "font-inconsolata-nerd-font"
brew "font-monofur-nerd-font"
brew "font-overpass-nerd-font"
brew "font-ubuntu-mono-nerd-font"
brew "font-agave-nerd-font"
brew "font-arimo-nerd-font"
brew "font-anonymice-nerd-font"
brew "font-aurulent-sans-mono-nerd-font"
brew "font-bigblue-terminal-nerd-font"
brew "font-bitstream-vera-sans-mono-nerd-font"
brew "font-blex-mono-nerd-font"
brew "font-caskaydia-cove-nerd-font"
brew "font-code-new-roman-nerd-font"
brew "font-cousine-nerd-font"
brew "font-daddy-time-mono-nerd-font"
brew "font-dejavu-sans-mono-nerd-font"
brew "font-droid-sans-mono-nerd-font"
brew "font-fantasque-sans-mono-nerd-font"
brew "font-fira-code-nerd-font"
brew "font-geist-mono-nerd-font"
brew "font-go-mono-nerd-font"
brew "font-gohufont-nerd-font"
brew "font-hack-nerd-font"
brew "font-hasklug-nerd-font"
brew "font-heavy-data-nerd-font"
brew "font-hurmit-nerd-font"
brew "font-im-writing-nerd-font"
brew "font-iosevka-nerd-font"
brew "font-jetbrains-mono-nerd-font"
brew "font-lekton-nerd-font"
brew "font-liberation-nerd-font"
brew "font-meslo-lg-nerd-font"
brew "font-monoid-nerd-font"
brew "font-mononoki-nerd-font"
brew "font-mplus-nerd-font"
brew "font-noto-nerd-font"
brew "font-open-dyslexic-nerd-font"
brew "font-profont-nerd-font"
brew "font-proggy-clean-tt-nerd-font"
brew "font-roboto-mono-nerd-font"
brew "font-sauce-code-pro-nerd-font"
brew "font-shure-tech-mono-nerd-font"
brew "font-space-mono-nerd-font"
brew "font-terminess-ttf-nerd-font"
brew "font-tinos-nerd-font"
brew "font-ubuntu-nerd-font"
brew "font-victor-mono-nerd-font"

# Apple developer fonts not available via brew

# Core casks
cask "google-chrome"
cask "arc"
cask "raycast"
cask "stats"

# Development tool casks
cask "visual-studio-code"
cask "warp"
cask "dbngin"
cask "github"
cask "httpie"
cask "postman"
# cask "postman-cli" (Optional)
cask "altair-graphql-client"
cask "transmit"
cask "tailscale"
cask "tableplus"
cask "mongodb-compass"
# Includes Docker, Docker Compose, and Kubernetes
cask "orbstack"
# Window's VM's on Mac
cask "utm"

# Design casks
cask "figma"
cask "framer"
cask "spline"
cask "rive"

# Misc casks
cask "1password"
cask "1password-cli"
cask "hiddenbar"
cask "chatgpt"
cask "itsycal"
cask "notion"
cask "slack"
cask "zoom"
cask "reminders-menubar"
cask "discord"
cask "obsidian"
cask "obs"
cask "iina"
cask "keka"
cask "timemachineeditor"
cask "numi"
cask "pictogram"
cask "nucleo"
cask "protonvpn"

# Optional casks
# cask "docker" (Orbstack instead of Docker Desktop)
# cask "alfred" (Raycast instead of Alfred)
# cask "keycastr" (KeyStroke Pro instead of KeyCastr)
# cask "rectangle" (Magnet instead of Rectangle)
# cask "tradingview" (Optional trading application)
# cask "webull" (Optional trading application)
# cask "ledger-live" (Optional trading application)
# cask "todoist" (Reminders instead of Todoist)
# cask "microsoft-edge" (Optional)
# cask "firefox-developer-edition" (Optional)
# cask "brave-browser" (Optional)
# cask "chromium --no-quarantine" (Optional)

# Untap
# untap "homebrew/cask-versions"
# untap "homebrew/cask-fonts"
# untap 'homebrew/bundle'

# Configure this to your own Mac App Store downloads/purchases

# Install Mac App Store apps (listed under your purchased apps in the App Store)
# Search using 'mas search "APP NAME"'
# mas "Slack", id: 803453959
mas "Magnet", id: 441258766 # (Paid, Optional can use Raycast Window Management)
mas "Klack", id: 2143728525 # (Paid, Optional)
mas "KeyStroke Pro", id: 1572206224 # (Paid, Optional)
mas "Cursor Pro", id: 1447043133 # (Paid, Optional)



# Example Brewfile for reference
# 'brew tap'
#tap "homebrew/cask"
# 'brew tap' with custom Git URL
#tap "user/tap-repo", "https://user@bitbucket.org/user/homebrew-tap-repo.git"
# 'brew tap' with arguments
#tap "user/tap-repo", "https://user@bitbucket.org/user/homebrew-tap-repo.git", force_auto_update: true

# set arguments for all 'brew install --cask' commands
#cask_args appdir: "~/Applications", require_sha: true

# 'brew install'
#brew "imagemagick"
# 'brew install --with-rmtp', 'brew services restart' on version changes
#brew "denji/nginx/nginx-full", args: ["with-rmtp"], restart_service: :changed
# 'brew install', always 'brew services restart', 'brew link', 'brew unlink mysql' (if it is installed)
#brew "mysql@5.6", restart_service: true, link: true, conflicts_with: ["mysql"]
# install only on specified OS
#brew "gnupg" if OS.mac?
#brew "glibc" if OS.linux?

# 'brew install --cask'
#cask "google-chrome"
# 'brew install --cask --appdir=~/my-apps/Applications'
#cask "firefox", args: { appdir: "~/my-apps/Applications" }
# bypass Gatekeeper protections (NOT RECOMMENDED)
#cask "firefox", args: { no_quarantine: true }
# always upgrade auto-updated or unversioned cask to latest version even if already installed
#cask "opera", greedy: true
# 'brew install --cask' only if '/usr/libexec/java_home --failfast' fails
#cask "java" unless system "/usr/libexec/java_home --failfast"

# 'mas install'
#mas "1Password", id: 443987910

# 'whalebrew install'
#whalebrew "whalebrew/wget"
