# Taps
# Note on Casks: Some casks may not be the most up to date version and may be broken
tap "homebrew/bundle"
tap "mongodb/brew"
tap "buo/cask-upgrade"
tap "oven-sh/bun"
tap "shaunsingh/SFMono-Nerd-Font-Ligaturized"

# Install core utilities (those that come with OS X are outdated).
brew "coreutils"

# Install some other useful utilities.
brew "moreutils"

# Install `find`, `locate`, `updatedb`...
brew "findutils"

# Install other necessary binaries.
brew "grep"
brew "ripgrep"
brew "gnu-sed"
brew "openssh"
brew "wget"
brew "ruby"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "bash"
brew "bash-completion"
brew "neovim"
brew "tmux"
brew "lazygit"
brew "fzf"
brew "btop"
brew "bottom"
brew "gdu"
brew "git"
brew "hub"
brew "libpq"
brew "gh"
brew "uv" # python package and project manager (no need for pip)
brew "fd"
brew "ccat"
brew "eza" # replacement for exa (no longer maintained)
brew "bat"
brew "httpstat"
brew "zoxide"
brew "atuin"
brew "mkcert"
brew "trash"
brew "mackup"
brew "mas"
brew "navi"

# Development binaries
brew "deno"
brew "bun"
brew "mysql-client"
brew "mongodb-community"
brew "cloudflared"
# Kubernetes Package Manager
brew "helm"
# Kubernetes Compose Conversion Tool
brew "kompose"
# Github Actions locally
brew "act"
# Fly.io CLI
brew "flyctl"

# Optional, but recommended binaries
#brew 'pngquant'
#brew 'svgo'
#brew 'gifsicle'
#brew "railway"
#brew "awscli"
#brew "doctl"

# Font util
brew "font-util"

# Fonts + Nerd Fonts
# Most not available in Google Fonts install
# To search: brew search "/font-/"
cask "font-monaspace"
cask "font-input"
cask "font-geist"
cask "font-gilbert"
cask "font-cascadia-code"
cask "font-monoid"
cask "font-qwigley"
cask "font-hasklig"
cask "font-covered-by-your-grace"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-league-gothic"
cask "font-rambla"
cask "font-share-tech"
cask "font-ibm-plex-mono"
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-3270-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-monofur-nerd-font"
cask "font-overpass-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-agave-nerd-font"
cask "font-arimo-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-cousine-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-mplus-nerd-font"
cask "font-noto-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-victor-mono-nerd-font"

# Core casks
cask "google-chrome"
cask "arc"
cask "raycast"
cask "stats"
cask "appcleaner"

# Development tool casks
cask "iterm2"
cask "ghostty"
cask "wezterm"
cask "visual-studio-code"
cask "cursor"
cask "dbngin"
cask "github"
cask "httpie"
cask "postman"
cask "beekeeper-studio"
cask "altair-graphql-client"
cask "transmit"
cask "tailscale"
cask "tableplus"
cask "mongodb-compass"
# cask "hyper" (Optional)
# cask "warp" (Optional)
# cask "postman-cli" (Optional)
# Includes Docker, Docker Compose, and Kubernetes
cask "orbstack"
# Run VM's on Mac
cask "utm"
cask "vagrant"
# PHP tools (php, composer, laravel, expose) - prefer to run these tools in containers
# cask "herd" (Optional)

# Design casks
cask "figma"
cask "framer"
cask "spline"
cask "rive"

# Misc casks
cask "1password"
cask "1password-cli"
cask "hiddenbar"
cask "chatgpt"
cask "itsycal"
cask "notion"
cask "slack"
cask "zoom"
cask "reminders-menubar"
cask "discord"
cask "obsidian"
cask "obs"
cask "iina"
cask "keka"
cask "timemachineeditor"
cask "numi"
cask "pictogram"
cask "nucleo"
cask "protonvpn"

# Configure this to your own Mac App Store downloads/purchases

# Install Mac App Store apps (listed under your purchased apps in the App Store)
# Search using 'mas search "APP NAME"'
# mas "Slack", id: 803453959
mas "Magnet", id: 441258766 # (Paid, Optional can use Raycast Window Management)
mas "Klack", id: 6446206067 # (Paid, Optional)
mas "Parcel", id: 639968404 # (Paid, Optional)
mas "KeyStroke Pro", id: 1572206224 # (Paid, Optional)
mas "Cursor Pro", id: 1447043133 # (Paid, Optional)

# Optional casks
# cask "docker" (Orbstack instead of Docker Desktop)
# cask "alfred" (Raycast instead of Alfred)
# cask "keycastr" (KeyStroke Pro instead of KeyCastr)
# cask "rectangle" (Magnet instead of Rectangle)
# cask "tradingview" (Optional trading application)
# cask "webull" (Optional trading application)
# cask "ledger-live" (Optional trading application)
# cask "todoist" (Reminders instead of Todoist)
# cask "microsoft-edge" (Optional)
# cask "firefox-developer-edition" (Optional)
# cask "brave-browser" (Optional)
# cask "chromium --no-quarantine" (Optional)
